var data = [
  
    
    {
      url: "https://shiiiiiiiii1.github.io/PortfolioSiteHugo/portfolio/ProductPackageDesign/",
      title: "卵のパッケージデザイン",
      content: "[Concept 地面からの距離をとった吸収 ケント紙の紙を使って作るということなので 力の吸収や、分散が重要なカギになると思いました。 また、卵を割れないようにするには落下して 地面と接触した時により地面からの衝撃が ないようにしなければならないと考えました。 そのためには、必然的に地面からの距離を より長くしたほうが、衝撃を吸収しやすいのでは ないかと考えました。 例として市販に売られている卵の プラスチックパッケージを見てみました。 よく見ると上下に隙間が空いています。 これは地面と接触した時に直接の衝撃よりも 空間があいていたほうが卵自体への衝撃は 和らぐからだと考えました。 プラスチックパッケージの構造としては 左のような構造になっており、卵と衝撃の 間にある空間を入れることで 力の吸収が行われているのだとと思いました。 また、卵の上にも空間があいているのは 上下どちらから落ちても衝撃を和らげることが できるからだと思います。 Thought ケント紙を使って作るという条件なので 構造がとても重要になってくると思いました。 そこで考えたのは卵のプラスチックパッケージと 同じような仕組みを利用して作ろうと考えました。 衝撃と卵の間に空間を作り、そこの間に 衝撃を吸収する構造を入れればいいのではないかと 考えました。衝撃を吸収するということで思いついたのが バネの仕組みです。バネをその空間との間に入れより 衝撃の吸収をしたらいいのではないかと考えました。 idea Sketch Structure 1箱目 衝撃を和らげるためには ケント紙をギザギザに 折ったものを四方八方に 覆いました。これにより、 落下時に衝撃を受けた時、 ギザギザによって衝撃を 和らげてくれます。 2・3箱目 次に２箱目には前後にバネを、３箱目には左右にバネを、といったように 一箱に２面ずつバネ板を入れていき、さらに衝撃を和らげるような仕組みにしました。 ２面張ったバネの板との間に１箱目・２箱目の箱を入れていきバネで前後左右が 覆われるようにしました。このときに入れ方を前後左右の位置にしっかりバネが 来るようにしなければなりません。（バネの面がかぶるとバネのない面ができてしまう） 4箱目 最後にバネ板が入っていない面（上下）に バネ板が入るように収納していく。 入れ終わると最終的に直方体の箱になり 四方八方をバネ板で覆われているといった 仕組みになっている。 Drawing 1箱目 2箱目 3箱目 4箱目 Product 最終的にはシンプルな形になりました。自分の思い通りの形にできたので良かったです。しかし、 この形だと角が下になって落ちた時と、面が下になって落ちた時とでは卵にかかる力の大きさが 変わってしまいます。そこを考えて作れたら良かったと思います。毎回同じように 落ちるようにすればもっと安定して割れないプロダクトを提案できたと思います。]",
      tags: [
        
          
          "パッケージデザイン"
        
          ,
          "クリエーション"
        
          ,
          "基礎デザイン制作１"
        
      ]
    }
  
    ,
    {
      url: "https://shiiiiiiiii1.github.io/PortfolioSiteHugo/portfolio/",
      title: "Portfolios",
      content: "[]",
      tags: [
        
      ]
    }
  
]