var data = [
  
    
    {
      url: "https://shiiiiiiiii1.github.io/PortfolioSiteHugo/portfolio/Hackathon_KONICA/",
      title: "仕事のグローバル化に対応したサービス",
      content: "[テーマ 未来の働き方を想起させるサービスの提案 アイデアコンセプト 海外とのプロジェクトのやり取りをもっと円滑に 背景 未来の働き方を想像した時に、現在よりもさらに他国との協力したプロジェクトが増えると考えました。 ターゲット 上記の背景から今回想定したターゲットは 多国籍企業とのやり取りを行なっている 30代男性独身 在宅ワークをしている といった属性を持っている人をターゲットとした。 ターゲットが抱える問題 距離が遠いので現在の時刻や相手が何をしているのかわからない。そのため連絡したい時に、して良いのかがわからない。 プロダクトの説明 相手の状態を知ることのできるプロダクト 互いのユーザーがそれぞれそのプロダクトを持っている。 机の上にそれを置くことにより、デスクで作業をしているときは相手にそれが通知される。 また、作業を行なっている時間は、勤務時間と見なし連絡できる時間として知らせる。 使用の流れ 相手の情報（プロジェクト名、氏名、設定色）を指定する。 プロダクトをいつもの作業スペースにおく。 いつも通りに作業していると、センサーが反応し作業状態を伝える。 また、相手も作業をしているとそれがわかる。 作業している状態になったら、それを設定したLEDの色として見ることができる。 競合サービス slack slackの問題点 違うプロジェクトを開いていても、全部のプロジェクトが「active」状態になってしまう。 アプリケーションを開かないと相手の状態がわからない。 slackとの差別化 プロダクトとして落とし込むことによって、自然な流れで相手の状態を知ることができる。 展望 LEDの部分をコニカミノルタの可視化技術を使ってよりわかりやすく使いやすくする。 登録をiOSアプリ、Androidアプリで行えるようにする。 加速度センサを使ったりしてより正確な情報を相手に伝えるようにする。]",
      tags: [
        
          
          "ハッカソン"
        
          ,
          "コニカミノルタ"
        
          ,
          "Raspberry Pi"
        
          ,
          "組み込み"
        
      ]
    }
  
    ,
    {
      url: "https://shiiiiiiiii1.github.io/PortfolioSiteHugo/portfolio/Planning_ComponentToy/",
      title: "ちょっとコースター",
      content: "[コンセプト 作るだけで終わらない 背景 チームメンバーが子供の頃に体験した経験をもとに、こういう背景ってあるよねっていうことを話し合いながら考えました。 遊園地が近くにないところに住んでいるため、遊園地に行く時がとても貴重で楽しみにしている。そんな中いざ行ってみて楽しもうとするとジェットコースターに身長制限がかかっていてお姉ちゃんは乗れるけど自分は乗れない。 こういった背景のもと身長制限のある子どもでもジェットコースターを楽しみたいということを実現しました！ ターゲット 6〜7歳の男の子 身長が120cmない 兄姉がいる 遊園地が近くにないところに住んでいる プラレールなどの自分で組み合わせて作ることが好き おもちゃ説明 現実世界ではジェットコースターに乗れない子供にもジェットコースターのワクワクを味わってもらいたい。 また、みんなが乗ってるあの感覚を味わいたい。という思いを実現するためのものです。 使い方としては、 自分の好きなジェットコースターのコースを組み合わせることができる。 自分の好きなジェットコースターの乗り物を選ぶ。 360°カメラをジェットコースターの乗り物にセットする。 簡易VRにスマートフォンを装着する。 ジェットコースターをスタートし、VRでジェットコースターを体感する。 のフローで使用できます。 キーファクター ジェットコースターが体感できる オリジナルのコースが作れる 自由な場所で遊べる STP 価格設定 ¥8,000 価格帯の理由 プラレールスターターキット：3000円 簡易スマートフォン埋め込み型VR：600円 360°カメラ：4400円（将来の理想価格） セット内容 レール×50 ジェットコースター本体 簡易スマートフォン埋め込み型VR 360°カメラ プロモーション 遊園地のお土産売り場での販売 YouTubeを活用したオリジナルコースの作成 今後の課題 360°カメラの価格の設定 スピード感の実現方法 今後の発展 Disney、富士急とのコラボ商品 様々なジオラマセットを発売]",
      tags: [
        
          
          "企画"
        
          ,
          "おもちゃ"
        
          ,
          "構成要素"
        
      ]
    }
  
    ,
    {
      url: "https://shiiiiiiiii1.github.io/PortfolioSiteHugo/portfolio/Product_GraduateDepartment/",
      title: "学部生の卒業制作",
      content: "[Background 近年では、カメラを使用した見守りシステムが多く存在します。なぜカメラを使用したものが増えているかというと、視覚的情報として正確に情報を伝えることができるからです。 例として、カメラを使用した見守りシステムを3つ紹介します。 ペットを対象とした見守りシステム Qwatch I-O DATA：Link 盗難防止用の見守りシステム VL-WD712K Panasonic：Link 人を対象とした見守りシステム KX-HJC200K-W Panasonic：Link 今回はこれらの中から 人を対象とした見守りシステム について焦点を当てて考えていきました。人を対象とした見守りシステムには、見守る人 と 見守られる人 の2つの立場があります。 これらの人が見守りシステムを使用する理由 見守る人 必要な情報を得るために使用。 見守られる人 必要な情報を相手に伝えるために使用。 これらのことから考えられることは、人を対象とした見守りに カメラが本当に必要あるのか ということです。 カメラを使用する必要がない理由として 情報を事細かに伝えることができるため、見守られる側の人のプライバシーがないこと。 見守る側の人は、見守りたい時間ずっと画面の前にいて監視していなければならないこと。 これらが挙げられます。 Theme そこで今回私が研究するテーマは、 視覚的情報ではなく、文章化した情報で伝達する。 ということです。 映像などの視覚的情報では、事細かに相手に伝えてしまうため、違った方法を用いて文章化し、それを伝達することで問題の解決ができると考えました。 System センサー情報を取得 文章化する Twitterへ投稿 相手に情報を伝える Prototype 使用したセンサー 温湿度気圧センサー 照度センサー 加速度センサー 音センサー 赤外線センサー Twitterへの投稿 Twitterへの投稿は、大きく分けて二つの手順に分けて行いました。 1つ目は、インターネットへの接続です。これは、無線付きモジュールである ESP-WROOM-02 を使用しました。IDEは、Arduinoを使用しインターネットへ接続しました。 2つ目は、Twitterへの投稿です。Twitterへの接続は、Twitterが公開しているAPIを使用して行いました。 テストの様子 今回実装できた内容 電気の消灯 エアコンのオンオフ 窓の開閉 ドアの開閉 Task 今後の課題は大きく分けて2つあります。 より多くの行動をセンサーで読み取る。 環境が変わっても柔軟に動作できるようにしなければならない。 Prospect 今後の展望としては、いろいろな環境に対応させるためにき、機械学習を使用していけたら良いと考えています。]",
      tags: [
        
          
          "Arduino"
        
          ,
          "温湿度気圧センサー"
        
          ,
          "照度センサー"
        
          ,
          "加速度センサー"
        
          ,
          "サウンドディテクター"
        
          ,
          "焦電型人感センサー"
        
          ,
          "卒業制作"
        
      ]
    }
  
    ,
    {
      url: "https://shiiiiiiiii1.github.io/PortfolioSiteHugo/portfolio/Product_ACTEE/",
      title: "ACTEE",
      content: "[Introduction 今回は、3人グループで製品の提案を行いました。私はテクノロジー分野を担当し、ハードウェアとソフトウェアの設計を行いました。 ハードウェアで使用したものは、マイコンとしてArduino pro mini、センサーは加速度センサーを使用しました。詳細は、Githubページに記載してあります。 また、在学している法政大学のホームページにも掲載されています。リンク Result ハードウェアコンテストGUGENに応募しました。 ほしいね賞をいただくことができました！ GUGENマイページはこちらから Concept action × effection よりアクティブに、より楽しく アクティブな遊びにより効果的な反応がかえってくることでより遊びが楽しくなる。ACTEEは動きに合わせた反応を返してあげることでよりアクティブに、より楽しくなる遊びを実現するために作られたフライングディスクです。 Target user 大人から小さい子供までわいわい楽しめます。 Mode モードは4つのモードがあり、好きなモードで遊ぶことができます。 Normal ノーマルモードでは投げ方の良し悪しを判定し、色を変化させ、反応を返します。投げ方が良くないと赤に変化し、普通だと黄色、うまく投げられた時は青色に変化します。 Sugoroku すごろくモードではノーマルモードで判断した投げ方の良し悪しから点数化し、その点数に合わせて赤いライトが点灯します。また赤く点灯するライトの数が最大になるとフラッシュライトになり、ポイントがリセットします。仲間内で誰が投げた時にフラッシュライトになったのか判定して遊ぶことができます。 Bomb 爆弾モードは爆弾ゲームのようなスリルをフリスビーで味わうことができるものです。上手く投げれないとその分早くACTEEの爆発（フラッシュ）がおこります。また、爆発までの時間はACTEE自体の色の変化から認識することができます。 Art アートモードは動きに応じてライトの色が変化するモードです。素早く動かせば動かすだけ様々な色に変化し、ゆっくり動かすと色の変化も穏やかになります。自由に動かし光の変化を楽しむことと、一眼カメラの長時間露光モードかスマートフォンアプリで光の軌跡を撮影することで美しいアートを描くことができます。 Structure]",
      tags: [
        
          
          "Arduino"
        
          ,
          "GUGEN"
        
          ,
          "応用プロジェクト制作"
        
      ]
    }
  
    ,
    {
      url: "https://shiiiiiiiii1.github.io/PortfolioSiteHugo/portfolio/Web_PortfolioSecond/",
      title: "レスポンシブデザインを使用したサイト",
      content: "[一回目に制作した時は、レスポンシブデザインに対応していなかったので、今回はレスポンシブデザインに対応させることを目標として行いました。また、SCSSを使用することでより時間の短縮をしてデザインの実装をしていきました。classも指定するだけで決まったデザインになるようにcssを組んでいきました。]",
      tags: [
        
          
          "ウェブサイト"
        
          ,
          "HTML"
        
          ,
          "SCSS"
        
          ,
          "JavaScript"
        
          ,
          "ポートフォリオ"
        
      ]
    }
  
    ,
    {
      url: "https://shiiiiiiiii1.github.io/PortfolioSiteHugo/portfolio/Web_Drawsketch/",
      title: "Draw Sketch",
      content: "[初めてのwebアプリケーションの制作だった。Life is techでのインターンの内容だったので railsを使用せずにsinatraで始めた。Draw Sketchは簡単に言うとtwitterやinstagramなどの webサービスだ。twitterはつぶやくこと中心、instagramは写真を共有することが中心。 今回のDraw Sketchは、絵を描いてそれを共有するサービスである。現代のアプリケーションの 流れを考えたときに、絵を描くことが好きな人はきっとそれを共有したいと思うのではないのか といった考えのもと制作しようと思った。また、これを制作後、Rubyに興味をもち、Railsの勉強をした。 現在は、Railsを使用した企業でアルバイトをしている。]",
      tags: [
        
          
          "Ruby"
        
          ,
          "sinatra"
        
          ,
          "MySQL"
        
          ,
          "データベース"
        
          ,
          "Life is Tech"
        
      ]
    }
  
    ,
    {
      url: "https://shiiiiiiiii1.github.io/PortfolioSiteHugo/portfolio/Web_PortfolioFirst/",
      title: "初めてのWebサイト制作",
      content: "[Process はじめての１からのホームページの作成だったのでこれからも再考しより良いものへ変えていきたいと考えている。 Concept カッコよく、まとまりのある 自分の中でかっこいいとは、、、 大人らしい雰囲気の人。落ち着きがあってクール。落ち着きがあるとはどんなイメージを与えられているのか、大人と子供の反対の立場から考えた。 モノクロを主としてまとめていく上で、インパクトが欲しかったのでアクセントカラーを入れた。アクセントカラーは、自分の雰囲気に合うような色にしようと思ったので、色が与える印象を調べて決めた。 赤色が人に与える印象 赤色のイメージは、情熱 などの、燃え上がるようなイメージがある。自分の負けず嫌いで人と競い合うことに熱くなる、といったところが赤色にぴったりであると考えた。また、赤は一番に目を引く色なので、シンプルなデザインの中に入れる色としてはいいと思った。 黒色よりも赤色でアクセントを入れることで名前をより、注目的にする。 UI Design コンセプトをもとにデザインを設計。 コンセプトから、モノクロといったイメージになったのでこれを組み込んでいった。photoshopでのデザイン設計で、自分の中でのイメージを具現化した。ここでの設計をしっかりしておかないと、codingするときにデザインの大幅な変更は大変である。だから、デザイン設計はホームページを作る上で一番重要な作業といえる。 Coding 読みやすく、無駄を少なく UIデザインを決定してから、コードに移す。細かい動きをjQueryで制御した。また、新しい作品をアップするときにより手間を省くことができるようなhtmlの構築をした。 GoogleChromeのデベロッパーツールを使用しながら検証]",
      tags: [
        
          
          "ウェブサイト"
        
          ,
          "HTML"
        
          ,
          "CSS"
        
          ,
          "JavaScript"
        
          ,
          "Illustrator"
        
          ,
          "Photoshop"
        
          ,
          "ポートフォリオ"
        
      ]
    }
  
    ,
    {
      url: "https://shiiiiiiiii1.github.io/PortfolioSiteHugo/portfolio/Technology_3DGame/",
      title: "Unityを使用した3Dゲーム",
      content: "[Unityを授業で初めて使った時の成果物。3Dゲームを作るという課題で私は、上から落ちてくる球をキャッチするというゲームを作成した。また、黄色い球をたまに出して点数を高く設定することで面白さを出した。]",
      tags: [
        
          
          "Unity"
        
          ,
          "ゲーム"
        
          ,
          "3DCGプログラミング"
        
      ]
    }
  
    ,
    {
      url: "https://shiiiiiiiii1.github.io/PortfolioSiteHugo/portfolio/Technology_ArduinoFirst/",
      title: "Arduinoを使用したセンサー制御",
      content: "[温度センサーと照度センサーの制御をした。制御した値を可視化できるように7セグメントLEDを使用した。実際に自分の部屋の環境で実験を行った。最初に部屋の温度を暗くして、照度センサーの値を確認した。そのあとにクーラーを最低温度に設定して部屋の温度を下げ、ドライヤーを温度センサー部分に当て温度を上げ実験した。難しかった点は、プログラミングと違って、センサー類はエラーを吐かないのでどうしてしっかりとした値を読み込んでいないのかを調べることが大変だった。今回は、基礎的な使い方を勉強しただけだが、これを用いることによって、問題解決するための手段が増えた。また、センサーを用いて制御できるので温度、湿度などの自然現象はもちろん、人の動きなどを感知したりして制御することもできるので、いろいろな場面での使用ができると感じた。]",
      tags: [
        
          
          "Arduino"
        
          ,
          "温度センサー"
        
          ,
          "照度センサー"
        
          ,
          "7セグメントLED"
        
          ,
          "組み込み制御プログラミング"
        
      ]
    }
  
    ,
    {
      url: "https://shiiiiiiiii1.github.io/PortfolioSiteHugo/portfolio/Technology_openframeworksFirst/",
      title: "OpenFrameworksをやってみた！",
      content: "[プログラミングはじめたての頃に、C&#43;&#43;を用いてopen frame worksをいじった。はじめは、コードを書くだけで画面上のものが動くことに感動した。このopen frame worksがプログラミングの中で自分の初めての成果物である。作品の概要が、複数の球がいろいろな速度、角度で飛んでいき、壁の当たるところによって 色が変わるというものだ。また、マウスをクリックすると全部の球がクリックしたところに集まってきて、ドラックをすると追従してくる。マウスをはなすと球がはじけて、また散らばっていく。]",
      tags: [
        
          
          "OpenFramewroks"
        
          ,
          "C&#43;&#43;"
        
          ,
          "テクノロジー"
        
          ,
          "プログラミング（テクノロジー系）"
        
      ]
    }
  
    ,
    {
      url: "https://shiiiiiiiii1.github.io/PortfolioSiteHugo/portfolio/Product_3DmodelCamera/",
      title: "Rhinocerosを使用した3Dモデリング",
      content: "[Background 多くの人のほとんどが人生で一度は利用するものそういった身近な製品の改良したいと考えました。 公共の施設 当たり前に行うこと 必然的に行わなければならないこと そこで着目したのが病院の診察です。病院は怪我をしたり、体調を崩したら必然的に行かなければならなくなると思います。その多くの人が利用する機関に、まだ改良できる部分はあるのではないかと考えました。 そこで私は自分の将来を考え病院に行く時期を考えました。必ず病院に行く時は人間ドックで検査をする時だと思いました。 その時に胃カメラを飲み込んで見せられた時にイメージがつきにくいのではないかと思い、その辺りの改善をしようと思いました。 History Concept 自分の体を自分で理解 自分は将来的に絶対通るであろう道の人間ドックについて考えました。その時に胃の中の説明はよくわからないし、ここの辺りと言われてもいまいち想像がつかないと思いました。そういった時に胃の中に入りながら説明されればより親近感が湧いてわかりやすい説明がしやすいのではないかと考えました。そこで、胃の中にいるような感覚で説明できるようなものを提案したいと考えました。しかし、現代の胃カメラでは前方しか録画できないのでこれを360°録画できるような構造にすれば良いと考えました。 Structure 胃カメラ 胃カメラの内部構造はおおまかにこのような感じになると思います。中身が露出しすぎて飲み込む時に抵抗があまり出ないように黄色くして覆いました。 ①LED電気、②CMOSセンサー、③ボタン電池、④ASIC(無線送信部)、⑤アンテナ、⑥カメラ モニタールーム ①アンテナ、②基板、③LED電気、④配線、⑤液晶モニター Image 胃の中を、360°モニターで映し出して、自分が胃の中に入っているような感覚で話を聞ける。こうすることによって、より細部まで観察することができる。また、胃の中をイメージして話が聞けるので理解力を促進することができる。 Rendering]",
      tags: [
        
          
          "Rhinoceros"
        
          ,
          "胃カメラ"
        
          ,
          "3Dモデリング（クリエーション系）"
        
      ]
    }
  
    ,
    {
      url: "https://shiiiiiiiii1.github.io/PortfolioSiteHugo/portfolio/Product_KettleDesign/",
      title: "空間に会う電子ケトルの提案",
      content: "[Space Propotion 高校生から大学生に変わり、気持ちの変化から落ち着いた空間の良さがよりわかるようになり、この「和」といった空間を選びました。また、この昔からの「和」の空間を邪魔しないデザインのケトルを提案しようと思いました。 Concept 「和」の空間を邪魔しない 和室はとても落ち着きがあり、ゆったりした気分になります。そういった雰囲気はほかの部屋には出せない、和室の特徴です。その特徴を壊してしまうと和室が和室でなくなってしまうと思います。だから、和室独自の特徴を残しつつ現代の電子ケトルというものを自然に取り入れられるデザインを考えました。 Process 「和」の空間を邪魔しないデザインにするために、「和」という特徴について考えました。「和」の自分の中のイメージとしては「古くからあるもの」「歴史として受け継がれているもの」といったイメージでした。そういったイメージの中で考えていき、思いついたのが「ししおどし」でした。ししおどしは、和の象徴とも言える竹を使っており、水も連想させるのでケトルにするにはいいと考えました。 Target User 自分のような高校生から大学生にあがり、環境の変化とともに気持ちも変化し今までなんとも思っていなかったことが違って見えたりすると思います。「和室」といった空間もそれと同様に、より好きになった人もいると思います。そういった若い人にも「和」の空間をより現代の生活に近いものにし生活しやすい空間にしようと思いました。 Sketch 持ち手を女性の小さい手でも持ちやすいようにすることを意識しました。参考としてペットボトルの形や寸法などを調べました。竹らしさを残すために曲線を意識してデザインしました。蓋は、電子ケトルらしさをなくさないために見えない位置に設置するようなデザインにしました。 Drawing 本体の三面図 土台の三面図 White Rendering 本体部 土台部 Mockup Rendering]",
      tags: [
        
          
          "電子ケトル"
        
          ,
          "Rhinoceros"
        
          ,
          "クリエーション"
        
          ,
          "造形デザイン実習制作"
        
      ]
    }
  
    ,
    {
      url: "https://shiiiiiiiii1.github.io/PortfolioSiteHugo/portfolio/Product_PackageDesign/",
      title: "卵のパッケージデザイン",
      content: "[Concept 地面からの距離をとった吸収 ケント紙の紙を使って作るということなので力の吸収や、分散が重要なカギになると思いました。また、卵を割れないようにするには落下して地面と接触した時により地面からの衝撃がないようにしなければならないと考えました。そのためには、必然的に地面からの距離をより長くしたほうが、衝撃を吸収しやすいのではないかと考えました。 例として市販に売られている卵のプラスチックパッケージを見てみました。よく見ると上下に隙間が空いています。これは地面と接触した時に直接の衝撃よりも空間があいていたほうが卵自体への衝撃は和らぐからだと考えました。 プラスチックパッケージの構造としては左のような構造になっており、卵と衝撃の間にある空間を入れることで力の吸収が行われているのだとと思いました。また、卵の上にも空間があいているのは上下どちらから落ちても衝撃を和らげることができるからだと思います。 Thought ケント紙を使って作るという条件なので構造がとても重要になってくると思いました。そこで考えたのは卵のプラスチックパッケージと同じような仕組みを利用して作ろうと考えました。衝撃と卵の間に空間を作り、そこの間に衝撃を吸収する構造を入れればいいのではないかと考えました。衝撃を吸収するということで思いついたのがバネの仕組みです。バネをその空間との間に入れより衝撃の吸収をしたらいいのではないかと考えました。 idea Sketch Structure 1箱目 衝撃を和らげるためにはケント紙をギザギザに折ったものを四方八方に覆いました。これにより、落下時に衝撃を受けた時、ギザギザによって衝撃を和らげてくれます。 2・3箱目 次に２箱目には前後にバネを、３箱目には左右にバネを、といったように一箱に２面ずつバネ板を入れていき、さらに衝撃を和らげるような仕組みにしました。２面張ったバネの板との間に１箱目・２箱目の箱を入れていきバネで前後左右が覆われるようにしました。このときに入れ方を前後左右の位置にしっかりバネが来るようにしなければなりません。（バネの面がかぶるとバネのない面ができてしまう） 4箱目 最後にバネ板が入っていない面（上下）にバネ板が入るように収納していく。入れ終わると最終的に直方体の箱になり四方八方をバネ板で覆われているといった仕組みになっている。 Drawing 1箱目 2箱目 3箱目 4箱目 Product 最終的にはシンプルな形になりました。自分の思い通りの形にできたので良かったです。しかし、この形だと角が下になって落ちた時と、面が下になって落ちた時とでは卵にかかる力の大きさが変わってしまいます。そこを考えて作れたら良かったと思います。毎回同じように落ちるようにすればもっと安定して割れないプロダクトを提案できたと思います。]",
      tags: [
        
          
          "パッケージデザイン"
        
          ,
          "クリエーション"
        
          ,
          "基礎デザイン制作１"
        
      ]
    }
  
    ,
    {
      url: "https://shiiiiiiiii1.github.io/PortfolioSiteHugo/portfolio/",
      title: "Portfolios",
      content: "[]",
      tags: [
        
      ]
    }
  
]